-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3308
-- Generation Time: Mar 10, 2022 at 08:28 AM
-- Server version: 5.7.14
-- PHP Version: 7.3.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `nodeapi`
--

-- --------------------------------------------------------

--
-- Table structure for table `articles`
--

DROP TABLE IF EXISTS `articles`;
CREATE TABLE IF NOT EXISTS `articles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `body` varchar(3000) NOT NULL,
  `category` int(11) NOT NULL DEFAULT '1',
  `created_by` int(11) NOT NULL DEFAULT '1',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `articles`
--

INSERT INTO `articles` (`id`, `title`, `body`, `category`, `created_by`, `created_at`) VALUES
(8, 'এবারও বিদেশিদের হজে যাওয়া বন্ধের কথা ভাবছে সৌদি', 'করোনা মহামারির মধ্যে টানা দ্বিতীয় বছরের মতো বিদেশিদের হজে যাওয়া বন্ধ করার কথা ভাবছে সৌদি আরব। বিশ্বজুড়ে করোনা সংক্রমণ বৃদ্ধি এবং নতুন ভেরিয়েন্টগুলো নিয়ে উদ্বেগ থেকে দেশটি এই সিদ্ধান্ত নিতে যাচ্ছে বলে বার্তা সংস্থা রয়টার্সের এক প্রতিবেদনে বলা হয়েছে। সংশ্লিষ্ট দুই সৌদি সূত্রের বরাত দিয়ে বুধবার রয়টার্সের খবরে বলা হয়, বিদেশিদের হজে যাওয়ার ওপর সম্ভাব্য নিষেধাজ্ঞার বিষয়ে আলোচনা হয়েছে। তবে এখনো এ বিষয়ে চূড়ান্ত সিদ্ধান্ত হয়নি।', 1, 1, '2021-05-05 14:08:18'),
(9, 'নকশা ছাড়াই ভবন বানিয়ে ফেলেছে এফবিসিসিআই', 'এফবিসিসিআইয়ের নতুন লোগো ও সংস্কার করা মতিঝিলের ফেডারেশন ভবনের (নতুন নাম এফবিসিসিআই আইকন) উদ্বোধনী অনুষ্ঠানে আজ বুধবার সংগঠনের সভাপতি শেখ ফজলে ফাহিম বলেন, ‘হাটখোলার ভবনটি তিন বছর ধরে পড়ে আছে। কারণ, ভবনটির নকশা পাস করা ছিল না। আমরা সম্প্রতি নকশা পাস করেছি।’ তিনি আরও জানান, মতিঝিলের ভবনের মালিকানা এখনো এফবিসিসিআইয়ের নামে নেই। মালিকানা নেওয়ার প্রক্রিয়া শুরু হয়েছে। শিগগিরই কাজটি হবে বলে আশা প্রকাশ করেন তিনি। ', 1, 1, '2021-05-05 14:08:59'),
(10, 'পরিস্থিতির উন্নতি না হলে ১ জুলাই থেকে ঢাবিতে অনলাইনে চূড়ান্ত পরীক্ষা', 'করোনাভাইরাস সংক্রমণ পরিস্থিতির উন্নতি না হলে আগামী ১ জুলাই থেকে অনলাইনে সব বর্ষের চূড়ান্ত পরীক্ষা নেওয়ার সিদ্ধান্ত নিয়েছে ঢাকা বিশ্ববিদ্যালয়ের ডিনস কমিটি৷ করোনা পরিস্থিতির কারণে গত বছরের ১৮ মার্চ থেকে বন্ধ আছে ঢাকা বিশ্ববিদ্যালয়ের স্বাভাবিক শিক্ষা কার্যক্রম৷ এর মধ্যে অনলাইনে ক্লাস ও দুটি সেমিস্টারের মিডটার্ম পরীক্ষা হলেও আটকে আছে সব বর্ষের চূড়ান্ত পরীক্ষা।', 1, 1, '2021-05-05 14:09:26'),
(11, 'মুম্বাইতে প্রথম শুরু হলো ‘ড্রাইভ ইন ভ্যাক্সিন’', 'ভারতের মধ্যে মুম্বাইয়ে প্রথম শুরু হলো ‘ড্রাইভ ইন’ টিকাদান কর্মসূচি। গতকাল মঙ্গলবার মুম্বাইয়ের দাদারের কোহিনুর সোসাইটির পার্কিং অঞ্চলে প্রথম ড্রাইভ ইন করোনা টিকাদান কেন্দ্র খোলা হলো। মুম্বাই মহানগর পালিকার উদ্যোগে এই কেন্দ্র খোলা হলো।', 1, 1, '2021-05-05 14:10:14'),
(12, 'উত্তর প্রদেশে পঞ্চায়েতে পিছিয়ে দুশ্চিন্তায় বিজেপি', 'পশ্চিমবঙ্গে আশা ভঙ্গের পর ভারতের কেন্দ্রীয় শাসক দল বিজেপিকে চিন্তায় ফেলল উত্তর প্রদেশ। রাজ্যের পঞ্চায়েত নির্বাচনে বিজেপিকে পিছনে ফেলে এগিয়ে গেছে বিরোধী সমাজবাদী পার্টি (এসপি)। এই ভোটকে বিজেপি যথেষ্ট গুরুত্ব দিয়েছিল। কারণ, আগামী বছর রাজ্য বিধানসভার ভোটের আগে এটাই ছিল শেষ শক্তি পরীক্ষা। রাজ্যের জেলা পঞ্চায়েত ক্ষেত্রগুলোর মধ্যে সমাজবাদী পার্টি পেয়েছে ৭৪৭ আসন। বিজেপি রয়েছে দ্বিতীয় স্থানে। তাদের প্রাপ্য আসন ৬৬৬। বহুজন সমাজ পার্টি (বিএসপি) ও কংগ্রেস পেয়েছে যথাক্রমে ৩২২ ও ৭৭টি আসন। বিধানসভা ভোটের আগে জেলা পঞ্চায়েত দখল সব রাজনৈতিক দলের কাছেই গুরুত্বপূর্ণ।', 1, 1, '2021-05-05 14:10:55'),
(13, 'নন্দীগ্রামের ভোট পুনর্গণনার মমতার আবেদন খারিজ', 'তৃণমূলের নেত্রী মমতা বন্দ্যোপাধ্যায়ের নন্দীগ্রাম আসনের ভোট পুনর্গণনার আবেদন খারিজ করে দিয়েছে নির্বাচন কমিশন। গতকাল মঙ্গলবার নির্বাচন কমিশন এ সিদ্ধান্তের কথা জানিয়েছে। কমিশন বলেছে, রিটার্নিং অফিসারের সিদ্ধান্তই চূড়ান্ত। মমতা বন্দ্যোপাধ্যায় ইচ্ছা করলে এটা নিয়ে নির্বাচনী মামলা করতে পারেন।', 1, 1, '2021-05-05 14:11:46'),
(14, 'শিক্ষা খাতে ক্ষতি পোষানো কীভাবে, নেই দীর্ঘমেয়াদি পরিকল্পনা', 'করোনায় প্রায় ১৪ মাস ধরে শিক্ষাপ্রতিষ্ঠান বন্ধ। শিক্ষার্থীদের শিক্ষাজীবন তছনছ। বড় ধরনের ক্ষতির মুখে শিক্ষা। কিন্তু এই ক্ষতি পোষাতে দীর্ঘমেয়াদি সুনির্দিষ্ট পরিকল্পনা নেই শিক্ষার দুই মন্ত্রণালয়ের হাতে। ক্ষতিগুলো মোটা দাগে জানা। তবে সুনির্দিষ্ট নয়। শিক্ষার্থীদের কতটুকু ক্ষতি হলো, তা এক বছরেও মূল্যায়ন করা যায়নি। কত শিক্ষার্থী পড়াশোনার বাইরে চলে গেল, তারও হিসাব নেই। অস্থায়ীভাবে যেসব পদক্ষেপ নেওয়া হয়েছে, সেগুলো মূলত শিক্ষাপ্রতিষ্ঠান খোলা ও পরীক্ষা ঘিরে। সেগুলোও বাস্তবায়িত হচ্ছে না।', 1, 1, '2021-05-05 14:13:02'),
(15, 'শিক্ষা খাতে ক্ষতি পোষানো কীভাবে, নেই দীর্ঘমেয়াদি পরিকল্পনা', 'করোনায় প্রায় ১৪ মাস ধরে শিক্ষাপ্রতিষ্ঠান বন্ধ। শিক্ষার্থীদের শিক্ষাজীবন তছনছ। বড় ধরনের ক্ষতির মুখে শিক্ষা। কিন্তু এই ক্ষতি পোষাতে দীর্ঘমেয়াদি সুনির্দিষ্ট পরিকল্পনা নেই শিক্ষার দুই মন্ত্রণালয়ের হাতে। ক্ষতিগুলো মোটা দাগে জানা। তবে সুনির্দিষ্ট নয়। শিক্ষার্থীদের কতটুকু ক্ষতি হলো, তা এক বছরেও মূল্যায়ন করা যায়নি। কত শিক্ষার্থী পড়াশোনার বাইরে চলে গেল, তারও হিসাব নেই। অস্থায়ীভাবে যেসব পদক্ষেপ নেওয়া হয়েছে, সেগুলো মূলত শিক্ষাপ্রতিষ্ঠান খোলা ও পরীক্ষা ঘিরে। সেগুলোও বাস্তবায়িত হচ্ছে না।', 1, 1, '2021-05-27 09:46:45');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

DROP TABLE IF EXISTS `categories`;
CREATE TABLE IF NOT EXISTS `categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `created_at`) VALUES
(1, 'uncategorized', '2021-05-03 10:23:21');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `photo` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `photo`, `created_at`) VALUES
(1, 'anonymous', 'anonymous@domain.com', '123456', NULL, '2021-05-03 10:21:58'),
(3, 'Sayeem', 'sayeem@domain.com', '123456', NULL, '2021-05-03 10:21:58');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
